; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph7 - mode
	image3 - mode
	spectrograph5 - mode
	infrared4 - mode
	spectrograph0 - mode
	infrared1 - mode
	infrared2 - mode
	spectrograph6 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 spectrograph6)
	(supports instrument0 infrared1)
	(supports instrument0 infrared4)
	(supports instrument0 spectrograph7)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph5)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(have_image Phenomenon5 spectrograph6)
	(have_image Star6 image3)
	(have_image Phenomenon7 spectrograph0)
	(have_image Phenomenon7 spectrograph6)
	(have_image Star8 infrared2)
	(have_image Phenomenon9 spectrograph7)
))

)

; plan
1. (turn_to satellite0 groundstation1 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 7
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite0 star8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star8)
   goals met: 0 of 7
5. (take_image satellite0 star8 instrument2 infrared2)
   added: (have_image star8 infrared2)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon7 instrument2 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 2 of 7
8. (turn_to satellite0 groundstation0 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 7
9. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 2 of 7
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
11. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 2 of 7
12. (turn_to satellite0 phenomenon5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 7
13. (take_image satellite0 phenomenon5 instrument0 spectrograph6)
   added: (have_image phenomenon5 spectrograph6)
   goals met: 3 of 7
14. (turn_to satellite0 phenomenon7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 7
15. (take_image satellite0 phenomenon7 instrument0 spectrograph6)
   added: (have_image phenomenon7 spectrograph6)
   goals met: 4 of 7
16. (turn_to satellite0 star6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star6)
   goals met: 4 of 7
17. (take_image satellite0 star6 instrument0 image3)
   added: (have_image star6 image3)
   goals met: 5 of 7
18. (turn_to satellite0 phenomenon9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 7
19. (take_image satellite0 phenomenon9 instrument0 spectrograph7)
   added: (have_image phenomenon9 spectrograph7)
   goals met: 7 of 7
